app/controllers/dogs_controller.rb

  def index
    @dogs = Dog.all
---
SELECT "dogs".* FROM "dogs"

  def create
    dog = Dog.create(dog_params)
---
INSERT INTO "dogs" ("name", "motto", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Pasha"], ["motto", "Kuzyk"], ["created_at", "2021-11-10 17:17:52.475863"], ["updated_at", "2021-11-10 17:17:52.475863"]]

  def update
    @dog.update(dog_params)
---
UPDATE "dogs" SET "motto" = ?, "updated_at" = ? WHERE "dogs"."id" = ?  [["motto", ""], ["updated_at", "2021-11-11 15:58:51.527381"], ["id", 2]]

  def destroy
    @dog.destroy
---
DELETE FROM "dogs" WHERE "dogs"."id" = ?  [["id", 3]]

  def current_dog
    @dog = Dog.find(params[:id])
---
SELECT "dogs".* FROM "dogs" WHERE "dogs"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]